Ran Plan for project: `prod-emnify` dir: `finance_revenue_report_s3_to_redshift/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.business-etl.aws_glue_crawler.csv_crawler will be updated in-place
~ resource "aws_glue_crawler" "csv_crawler" {
        arn           = "arn:aws:glue:eu-west-1:884047677700:crawler/prod-emnify-csv"
        classifiers   = [
            "prod-emnify-business-etl-csv-classifier",
        ]
        database_name = "prod-emnify-business-etl-csv"
        id            = "prod-emnify-csv"
        name          = "prod-emnify-csv"
        role          = "glue_iam_role"
        schedule      = "cron(0 0 * * ? *)"
        tags          = {}

      ~ s3_target {
            exclusions = []
          ~ path       = "s3://prod-emnify-business-etl-invoice-csv/" -> "prod-emnify-business-etl-invoice-csv/"
        }

        schema_change_policy {
            delete_behavior = "DEPRECATE_IN_DATABASE"
            update_behavior = "UPDATE_IN_DATABASE"
        }
    }

  # module.business-etl.aws_s3_bucket.finance_etl_glue_temp will be updated in-place
~ resource "aws_s3_bucket" "finance_etl_glue_temp" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::aws-glue-prod-emnify-business-etl-temp-eu-west-1"
        bucket                      = "aws-glue-prod-emnify-business-etl-temp-eu-west-1"
        bucket_domain_name          = "aws-glue-prod-emnify-business-etl-temp-eu-west-1.s3.amazonaws.com"
        bucket_regional_domain_name = "aws-glue-prod-emnify-business-etl-temp-eu-west-1.s3.eu-west-1.amazonaws.com"
        force_destroy               = false
        hosted_zone_id              = "Z1BKCTXD74EZPE"
        id                          = "aws-glue-prod-emnify-business-etl-temp-eu-west-1"
        region                      = "eu-west-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Application" = "business-etl"
            "Instance"    = "emnify"
            "Name"        = "glue_temp_script_bucket"
            "Stage"       = "prod"
        }

      ~ lifecycle_rule {
            abort_incomplete_multipart_upload_days = 0
            enabled                                = true
            id                                     = "tf-s3-lifecycle-20200116133321426700000002"
            tags                                   = {}

          - expiration {
              - days                         = 1 -> null
              - expired_object_delete_marker = false -> null
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.business-etl.aws_s3_bucket_object.s3_to_redshift_script will be created
+ resource "aws_s3_bucket_object" "s3_to_redshift_script" {
      + acl                    = "private"
      + bucket                 = "aws-glue-prod-emnify-business-etl-temp-eu-west-1"
      + content_type           = (known after apply)
      + etag                   = "776bcec35d77151c9015b9661558961a"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "prod-emnify-load_data_from_S3ToRedshift.py"
      + server_side_encryption = (known after apply)
      + source                 = "../../finance_revenue_report_s3_to_redshift/load_data_from_S3ToRedshift.py"
      + storage_class          = (known after apply)
      + tags                   = {
          + "Application" = "business-etl"
          + "Instance"    = "emnify"
          + "Name"        = "load_data_from_S3ToRedshift.py"
          + "Stage"       = "prod"
        }
      + version_id             = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p prod-emnify`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.oss-eks.emnify.net/lock?id=EMnify%252Fbusiness-etl%252Ffinance_revenue_report_s3_to_redshift%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p prod-emnify`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
